tutorials/fluidSolidInteraction/beamInCrossFlow/interElasticBeam/constant/fluid/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
//Level 0	
    (0 0 0)
    (0.45 0 0)
    (0.55 0 0)
    (1.5 0 0)
    (1.5 0 -0.2)
    (0.55 0 -0.2)
    (0.45 0 -0.2)
    (0 0 -0.2)
    (0 0 -0.4)
    (0.45 0 -0.4)
    (0.55 0 -0.4)
    (1.5 0 -0.4)
//Level 1	
    (0 0.2 0)
    (0.45 0.2 0)
    (0.55 0.2 0)
    (1.5 0.2 0)
    (1.5 0.2 -0.2)
    (0.55 0.2 -0.2)
    (0.45 0.2 -0.2)
    (0 0.2 -0.2)
    (0 0.2 -0.4)
    (0.45 0.2 -0.4)
    (0.55 0.2 -0.4)
    (1.5 0.2 -0.4)
//Level 2	
    (0 0.4 0)
    (0.45 0.4 0)
    (0.55 0.4 0)
    (1.5 0.4 0)
    (1.5 0.4 -0.2)
    (0.55 0.4 -0.2)
    (0.45 0.4 -0.2)
    (0 0.4 -0.2)
    (0 0.4 -0.4)
    (0.45 0.4 -0.4)
    (0.55 0.4 -0.4)
    (1.5 0.4 -0.4)
);

blocks
(
    hex (7 6 18 19 0 1 13 12) (16 8 8) simpleGrading (1 1 1)
    hex (8 9 21 20 7 6 18 19) (16 8 8) simpleGrading (1 1 1)
    hex (19 18 30 31 12 13 25 24) (16 8 8) simpleGrading (1 1 1)
    hex (20 21 33 32 19 18 30 31) (16 8 8) simpleGrading (1 1 1)
    hex (9 10 22 21 6 5 17 18) (4 8 8) simpleGrading (1 1 1)
    hex (21 22 34 33 18 17 29 30) (4 8 8) simpleGrading (1 1 1)
    hex (18 17 29 30 13 14 26 25) (4 8 8) simpleGrading (1 1 1)
    hex (5 4 16 17 2 3 15 14) (38 8 8) simpleGrading (1 1 1)
    hex (10 11 23 22 5 4 16 17) (38 8 8) simpleGrading (1 1 1)
    hex (17 16 28 29 14 15 27 26) (38 8 8) simpleGrading (1 1 1)
    hex (22 23 35 34 17 16 28 29) (38 8 8) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch inlet
    (
        (7 0 12 19)
        (8 7 19 20)
        (19 12 24 31)
        (20 19 31 32)
    )
    patch outlet
    (
        (3 4 16 15)
        (4 11 23 16)
        (15 16 28 27)
        (16 23 35 28)
    )
    wall top
    (
        (31 24 25 30)
        (32 31 30 33)
        (29 34 33 30)
        (26 29 30 25)
        (28 35 34 29)
        (27 28 29 26)
    )
    wall bottom
    (
        (0 7 6 1)
        (7 8 9 6)
        (6 9 10 5)
        (5 10 11 4)
        (2 5 4 3)
    )
    wall left
    (
        (20 21 9 8)
        (21 22 10 9)
        (22 23 11 10)
        (34 35 23 22)
        (33 34 22 21)
        (32 33 21 20)
    )
    symmetryPlane symmetry
    (
        (0 1 13 12)
        (2 3 15 14)
        (14 15 27 26)
        (13 14 26 25)
        (12 13 25 24)
    )
    wall interface
    (
        (1 6 18 13)
        (6 5 17 18)
        (5 2 14 17)
        (17 14 13 18)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
