tutorials/fluidSolidInteraction/beamInCrossFlow/interElasticBeam/0/solid/pointDD
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDD;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    interface
    {
        type           calculated;
        value          uniform (0 0 0);
    }
    bottom
    {
       type            fixedValue;
       value           uniform (0 0 0);
    }
    symmetry
    {
       type            symmetryPlane;
       value           uniform (0 0 0);
    }
}


// ************************************************************************* //
